Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Ghost King.tmx
Source language: ko_kr
Languages: en_us

source: 싸움 도중인데도 오히려 마샴바의 힘을 끌어내다니···
en_us: she brought out mashamba’s strength in the middle of a fight…

source: 아니, 재미의 영역이 아니야···
en_us: no, this wasn’t done for entertainment…

source: 13호라는 이름의 충실한 개가 되어 나에게 충성 중이다.
en_us: ...is on his way to becoming my loyal dog named 13.

source: 두우
en_us: dun

source: 뭐하냐?
en_us: what are you doing?

source: 목표라···
en_us: a goal, huh…

source: 삐질
en_us: sweat

source: 욱
en_us: hurk

source: 쿠득
en_us: clutch

source: 부스럭
en_us: rustle

source: 쿠르르
en_us: whoosh

source: 역시 내 딸이다.
en_us: i expected nothing less from my daughter.

source: 퉁
en_us: bump

source: 흑사맹 대호법
en_us: great guardian of the black death sect

source: 스으으
en_us: swoosh

source: 놈과 합을 나눌 때마다 의식이 점점···
en_us: every time I trade blows with him, my consciousness slowly…

source: 귀령왕의 실체는 무림의 뒷방 늙은이들이 공포로써 자리를 지키기 위해 지어낸 헛소문ꞏꞏꞏ
en_us: the ghost king is a rumor those geezers past their prime made up to instill fear and stay in power...

source: 슈슈슈슉
en_us: swoosh swoosh

source: 뼈해장국
en_us: pork ribs hangover soup

source: 오, 오해에요 선배!
en_us: j-jiho, this isn’t what it looks like!

source: 아니지, 사실은 안 쏘기를 바라는 거 아냐?
en_us: oh wait, i guess you don’t really want me to use it then!

source: 아 씨, 뭐야 중요할 때!
en_us: dammit, who’s texting me at such a crucial time?!

source: 그, 그럼요ㅎㅎ
en_us: y-yup, hehe.

source: 크크크크크
en_us: hahahaha

source: 지도 비무···
en_us: a lesson…

source: 영구야, 그 X끼 치워라.
en_us: yeong-gu, take that f*cker away.

source: 100원 모라자ꞏꞏꞏ
en_us: I’m short 100 won*...

source: 뭐지 이 기의 느낌은?
en_us: what’s this qi I’m sensing?

source: 척척척척
en_us: dun

source: 꼴보기 싫으니까.
en_us: I can’t stand the sight of you.

source: 어머, 이걸 맞고도 서있네?
en_us: oh my, you’re still standing after that?

source: 아무리 쓸어담아도 안 줄어들잖아!
en_us: the trash isn’t decreasing no matter how much I sweep!

source: 누, 누구냐?!
en_us: wh-who are you?!

source: 쿠 쿵
en_us: whabam

source: 끄아아아!
en_us: arghhh!!!

source: 어디서 맞고 다니니?{j}제대로 호흡하기조차 힘든 상태일 텐데,
en_us: who’s been beating you up? it should be difficult for you to even breathe in your condition.

source: 죽여ꞏꞏꞏ
en_us: kill...

source: 몽골과는 달리 어두운 기운이 가득한 곳이야.
en_us: unlike mongolia, this place is rife with dark energy.

source: 크으윽, 제발 닥쳐!!
en_us: ugh, please shut up!

source: 오만원
en_us: 50,000 won

source: 너 자신의 것이다.
en_us: ...is yours.

source: 내 할아버지의 가르침이다.
en_us: who you talked trash about, taught me.

source: 그 마이페이스가 갑자기 아프다더니 부르지 말라는 거 있죠?
en_us: can you believe that guy who usually does everything at his own pace suddenly got sick and told me not to call him?

source: 에이 씨, 뭐야 이건 또ꞏꞏꞏ
en_us: what the hell...?

source: 사뿐
en_us: land

source: 천정무희
en_us: heavenly dancer

source: 우리 무당의 존재 의의를···!
en_us: ...the meaning of wudang’s existence…!

source: 부 악
en_us: vroom

source: 기도 같은 방식으로 끌어모아서ꞏꞏꞏ
en_us: ...like how I twirled my instant noodles around my chopsticks...

source: 크억ꞏꞏꞏ!?
en_us: ugh...?!

source: 흑사맹을 끌어내려라!!
en_us: bring down the black death sect!!!

source: 투투투투투
en_us: whap whap whap wahp

source: 화산이 몰락하고 있다는 것도 모른 채ꞏꞏꞏ
en_us: the flower mountain sect has been falling apart and i didn’t know it...

source: 네 친구 놈 다리 한 짝은 받아 가겠다.
en_us: ...I’ll take your friend’s leg.

source: 푸학
en_us: kegh

source: 팀장님 말씀 못 들었어?
en_us: didn’t you hear the team leader?

source: 안돼 안돼,
en_us: no, not anymore.

source: 무당의 완전무결한 천하 통일이!
en_us: the day wudang completely unites the world is coming!

source: 어떻게 아비가 자식을 죽인단 말입니까!
en_us: how could a father kill his own son?!

source: 내 친구에게 무슨 짓을 한 거야ꞏꞏꞏ?
en_us: what did you do to my friend...?

source: 그래서 걔를 지켜보라고 시킨건가?
en_us: is that why he asked me to watch him?

source: 꿈은 아닌 것 같은데ꞏꞏꞏ
en_us: it doesn’t seem like it...

source: 촤촤촤촤
en_us: fwoosh

source: 까닥
en_us: beckon

source: 저 정도면 우리 궁주라 하더라도 감당하기 힘든 수준이다.
en_us: at that level, it’d be tough even for our sect leader, the king.

source: 에휴
en_us: sigh

source: 화륵
en_us: crush

source: 삑
en_us: beep

source: 먼저 떠나는 이 못난 엄마를 용서해주렴···
en_us: please forgive me for leaving you behind…

source: 와아아아
en_us: arghhh

source: 초식?
en_us: technique?

source: 하하하
en_us: hahaha

source: 방
en_us: flail

source: 실망이잖아!
en_us: i’m disappointed!

source: 어딨냐고!
en_us: where is it?!

source: 니한테는 볼장 다 봤다.
en_us: I’m done here.

source: 본녀를 농락한 죄의 대가가 어떨지 똑똑히 보여주지!
en_us: he will pay for making a fool out of me!

source: 내상?
en_us: internal injuries?

source: 뻐걱
en_us: thwack

source: 너 입 안 닥쳐?
en_us: shut up, will you?

source: 삐리리
en_us: bee dee deep

source: 강태연, 미안하지만 난 너 따위와 다르다.
en_us: i’m sorry, taeyeon, but I’m not like you.

source: 크아악
en_us: ahhh

source: 니가 여자를 사귀면 내 손에 장을 지진다!
en_us: if you get a girl to date you, i’ll eat my hat!

source: 왔다리
en_us: pace

source: 천한 것들끼리 잘도 어울리는군.
en_us: you low-lives sure like to flock together.

source: 촌
en_us: one

source: 꼭 거길 가야만 하냐?
en_us: must you do this?

source: 설마 아까 그 환영도 아저씨가ꞏꞏꞏ
en_us: was that ghost your doing too...?

source: 봐봐~
en_us: look.

source: 중 광
en_us: lights shop

source: 그거 한꺼번에 버려야 해, 쯧쯧.
en_us: you have to sweep them all in all at once, tsk tsk.

source: 휘리릭
en_us: whish

source: 오호, 이것 봐라?
en_us: oho, would you look at that?

source: 뭐, 뭐지ꞏꞏꞏ?!
en_us: wh-what...?!

source: 개방의 거지 놈?!
en_us: isn’t he that bum?!

source: 예, 총수님.
en_us: yes, boss.

source: 니가 나보다 강하다면 그렇게 해.
en_us: if you’re stronger than me, i’ll stand aside.

source: 빨리 뱉어!
en_us: quick, spit it out!

source: 빨리 도, 도망쳐ꞏꞏꞏ
en_us: r-run... hurry...

source: 귀·령·파!!
en_us: ghostly spirit wave!!!

source: 흠칫
en_us: flinch

source: 많이 컸구나.
en_us: you’re all grown up.

source: 큰일 났군ꞏꞏꞏ
en_us: this is bad...

source: 고수도 버티기 힘든 합주공선율도 버텨낸데다가ꞏꞏꞏ
en_us: ...he held his own against the ensemble tune, something that even masters struggle with...

source: 전륜법궁이라니···
en_us: the revolution palace…

source: 타락한 마샴바여, 곱게 내 손에 죽으라!
en_us: fallen mashamba, give up and die by my hand!

source: 읏!
en_us: ugh!

source: 대체 왜 이러는 거지?!
en_us: what’s wrong with me?!

source: 새외사궁중 가장 오래된 역사를 자랑하는 전륜법궁의 악신
en_us: the evil god of the revolution palace, the sect that boasts the longest history in murim’s outer nations.

source: 부르르
en_us: tremble

source: 몽골
en_us: mongolia

source: 끄아아아아
en_us: arghhh

source: 무, 무슨 생각을 하는 거야?!
en_us: wh-what am I thinking?!

source: 그 흑마왕이라도 후계자 농사 하나는 기가 막히게 못했나보군.
en_us: it seems the black demon king cultivates her successors extremely poorly.

source: 짝
en_us: am

source: 훽
en_us: turn

source: 아 진짜 개 ㅈ망겜이네 말도 안 되는 거.
en_us: ugh, I can’t believe it! this game is trash.

source: (의심)
en_us: (doubt)

source: 흡성대법으로 충격을 흡수하지 않았으면 불구가 될 뻔했어.
en_us: I would’ve lost a limb if I hadn’t absorbed the shock with the fundamental qi absorption technique.

source: 웅성
en_us: murmur

source: 무경단에서 당장 꺼져!
en_us: get the hell out of the murim patrol squad!

source: 걱정마라, 이 정도로 뒈지진 않으니까.
en_us: don’t worry, he won’t die.

source: 그런 공격은!
en_us: ...have nothing on me!

source: 아버지, 제발 그만···!
en_us: father, please stop…!

source: 하지만 저렇게 빠른 놈에게 귀령파를 맞히는 건 무리야!
en_us: but he’s so fast that it’s impossible to hit him!

source: 아침부터 술퍼먹고 미친놈을 다봤나ꞏꞏꞏ
en_us: i just had to run into a drunk first thing in the morning...

source: 내놓아라!
en_us: give it to me!

source: 도, 독버섯!?
en_us: p-poisonous mushrooms?!

source: 어디 보자···
en_us: let’s see here…

source: 사대호법 가신 배이나
en_us: vassal of the four great guardians, ina bae

source: 34화
en_us: episode 34

source: 억!
en_us: oof!

source: 더 빠르고 강한 기에 기반한 타격으로 맞서야 해.
en_us: I have to hit him with attacks grounded in faster and stronger qi.

source: 그 지랄을 해놓고 결국은 튀겠다?
en_us: he’s running away after causing this mess?

source: 스으으으
en_us: swirl

source: 정신을 차리고 보면 이미 맞은 후였다ꞏꞏꞏ
en_us: I’m getting hit before I can even process his moves...

source: 해 장 국
en_us: hangover soup

source: 확률과 별개로 검증이 전혀 되어있지 않은 상황에서···
en_us: there’s no certainty that this will work aside from probability…

source: 역시 넌 애송이야.
en_us: you really are just a brat.

source: 끄아아악
en_us: ahhhh

source: 그런 문파가 있었나?
en_us: did a sect with that name exist?

source: 싸악
en_us: sweep

source: 준비해.
en_us: get it ready.

source: 텁썩
en_us: grab

source: 웃ꞏꞏꞏ!
en_us: ugh...!

source: 니 멋대로 다 할 수 있는 게 아니라고.
en_us: you can’t just do whatever you want here.

source: 그렇지만 저놈, 아직 어린애인데 괜찮을까요?
en_us: but will it be all right? that guy’s still just a child.

source: 빠, 빨리ꞏꞏꞏ
en_us: h-hurry...

source: 타앙
en_us: whabam

source: 돼
en_us: pork and rice soup

source: 살인자예요!!
en_us: there’s a murderer!!!

source: 좀 보고 싶다니까?
en_us: just let me see it, okay?

source: 그래서 무경대에 들어왔어요.
en_us: that’s why I enrolled in murim police university.

source: 하나 더~
en_us: and that makes two!

source: 퓩
en_us: shatter

source: 체육관에서의 환영도 그렇고 뭔가 있는게 분명해!
en_us: first there was the ghost in gym, and now this. there’s definitely something going on here!

source: 귀령파!!
en_us: ghostly spirit wave!!!

source: 25화
en_us: episode 25

source: 저게···
en_us: that little…

source: 취해있었던 거야ꞏꞏꞏ
en_us: I wasn’t thinking...

source: 저 이상한 변태랑 빡빡이가 저한테 나쁜짓을 하려고 했는데ꞏꞏꞏ
en_us: that weird pervert and the baldy were trying to do bad things to me...

source: 촷
en_us: whish

source: 천 일 정 밀 산 업 (주)
en_us: metal parts company

source: 저만 믿으시죠 자르갈 형님!
en_us: trust me, jargal hyeong!

source: ㅋㅋㅋ 빼박이네 이ㅅ키!
en_us: hehe, just admit it already, ya jerk!

source: 크윽?!
en_us: ugh?!

source: 틱
en_us: grab

source: 그래서, 그 한 놈이 구월단 애들을 잡아넣었단 말이지?
en_us: so you’re saying for putting those ancient moon squad kids behind bars?

source: 그런거였나.
en_us: so that was it.

source: 방금 그건 꽤 괜찮았어ꞏꞏꞏ
en_us: not bad...

source: 이거만 보면 300% 확률로 귀령파 쏠 수 있다고?
en_us: you have a 3000% chance of unlocking the ghostly spirit wave if you watch this video

source: 토르카···
en_us: torka…

source: 설마?
en_us: could it be…?

source: 그 틈을 노리는 게야.
en_us: you need to aim for those holes.

source: 떠
en_us: thw

source: 영촌 향우
en_us: yeongchon building

source: 아까의 고민이 무색할 정도로 머리가 개운해진다.
en_us: I feel so refreshed that i don’t even remember what i was worried about...

source: 이렇게 활개치고 있었단 말이야?
en_us: so he’s been running around out there completely unchecked?

source: 훅
en_us: huff

source: 뚜벅
en_us: step

source: 벌떡
en_us: fwip

source: 이 이상의 무의미한 싸움은 용납하지 않겠다.
en_us: I won’t allow any more pointless fighting.

source: 콰{j}앙
en_us: bam

source: 무, 무슨 이런 괴물같은 맷집이ꞏꞏꞏ
en_us: h-his endurance is unbelievable...

source: 아니 왜 사람 얼굴에 빗자루를 던져ꞏꞏꞏ
en_us: what did you throw a broom at my face for...?

source: 죽지 않을 만큼만 패줄 테니까ꞏꞏꞏ
en_us: don’t worry, i’ll only beat you within an inch of your life...

source: 선배!!
en_us: seonbae!!!

source: 나는 지호 선배를 공격했다.
en_us: ...but I attacked jiho seonbae.

source: 크아아아!!
en_us: rahhh!!!

source: 미안하다 소년이여!
en_us: I’m sorry, young man!

source: 별 일 없습니다.
en_us: he’s been all right.

source: 사악
en_us: swoosh

source: 둥 웅
en_us: da dun

source: 거름이 되어주셔야 하겠습니다.
en_us: I’ll have you become fertilizer...

source: 방치하면 찾을 수도 없는 귀령을 쫓는 망자가 되겠지.
en_us: they’ll die if we let them continue this futile search for the ghost king.

source: 어이구, 어제 한 건 했다고 ㅈ랄하는거 봐라ꞏꞏꞏ
en_us: huh, look at you, acting all high and mighty after doing one good thing yesterday...

source: 부, 분명 자판기 주변에 동전 하나쯤 있을 법한데ꞏꞏꞏ
en_us: p-people usually drop loose change around vending machines, don’t they...?

source: 킥킥
en_us: hehe

source: 대호법 중원인들을 조심해라,
en_us: beware of the great guardians.

source: 아···
en_us: ah…

source: 팅
en_us: clank

source: 크억···!
en_us: ugh…!

source: 뭐···?
en_us: what…?

source: 무슨 생각을 했는데?
en_us: yeah, what were you thinking?

source: 구월단이랑 싸울 댄 어쩔 수 없이 써버렸지만ꞏꞏꞏ
en_us: I didn’t have a choice when I went up against the ancient moon squad, but...

source: 심장에 촌경을 맞고도 어떻게···
en_us: how is he still standing after I struck his heart with my one punch…?

source: 대막의 사람들이 잠시 시간을 끌어준 모양이지만
en_us: it seemed like the daemak people bought me some time...

source: 크아
en_us: argh

source: 가만ꞏꞏꞏ
en_us: hold on...

source: 빨리 사장님을ꞏꞏꞏ!
en_us: I need to get the president out of there...!

source: 어제 같은 일이 두 번 일어나지 않는다는 법은 없으니까.
en_us: there’s no guarantee what happened yesterday won’t happen again.

source: 이제야 좀 귀령수 같네!
en_us: it’s actually starting to look like the ghost king’s martial arts!

source: 개쉽다
en_us: easy af

source: 엄마···
en_us: mom…

source: 째릿
en_us: glare

source: 오늘을 영원히 잊지 않도록,
en_us: don’t you think I should punish you...

source: 이야, 요놈 봐라?
en_us: hey, what’s with you?

source: 무림맹이란 거대한 소속감에 취해 모두가 잊고 있었다.
en_us: we were all so caught up in being part of the murim alliance...

source: 그들의 말에 따르자면···
en_us: according to them…

source: 아, 아저씨ꞏꞏꞏ?
en_us: m-mister...?

source: 감히 너 따위가?
en_us: how dare you?

source: 삐르ꞏꞏꞏ
en_us: he’s fast...

source: 여기서 저놈이랑 붙게 되면 내 정체가 드러나는 것은 확실하겠지ꞏꞏꞏ?
en_us: if I fight him here, i’ll definitely be exposed...

source: 콰당
en_us: fling

source: 아니, 아무것도 아닐세.
en_us: no, it was nothing.

source: 이적은 다리가 그 모양이니 어쩔 수 없고···
en_us: gijeok lee can’t be here because of his leg…

source: 어떤 자식이 우리 유통망을 건드리나 했더니만ꞏꞏꞏ
en_us: I was wondering which bastard was messing with my distribution network...

source: 어찌하여 이러실 수가 있습니까···
en_us: how could you do this…?

source: 이 ㄱㅅ끼야!
en_us: you son of a b*tch!

source: 그러면 나한테 배울거야?
en_us: if I do that, are you gonna learn from me?

source: 무림인인가?
en_us: is he a murimist?

source: 슈아앗
en_us: swoosh

source: 흑사맹
en_us: black death sect

source: 무당의 무공을 배우면서 내 생각은 더욱 굳어졌어.
en_us: as i learned wudang’s martial arts, i became more and more convinced that i was right.

source: 죽여···
en_us: kill him…

source: 내 입으로 귀령의 힘을 다루는 방법을 알려달라고는 했지만···
en_us: I know i asked her to teach me how to use the ghost king’s power…

source: ㅎㅎ
en_us: hehe

source: 결국 이놈을 만나긴 했는데ꞏꞏꞏ
en_us: I finally got to meet him, but...

source: 화.사.설.하
en_us: flower serpent’s descending bite

source: 아쉽게 됐네 ㅎㅎ
en_us: what a shame, hehe.

source: 37화
en_us: episode 37

source: 빨리 귀령파를 날려보라고!
en_us: c’mon, use the ghostly spirit wave already!

source: 자, 잠깐 어디가요?!
en_us: w-wait, where are you going?!

source: 대체 무슨 일이 벌어지고 있는 거지?
en_us: what the heck is going on?

source: 날 너무 우습게 봤습니다 아저씨!
en_us: you underestimated me, mister!

source: 그렇게 무기력하게 당했을까ꞏꞏꞏ?
en_us: maybe then I wouldn’t have been defeated so easily...

source: 간격을 벌려봤자다.
en_us: there’s no use putting distance between us...

source: 아저씨ꞏꞏꞏ
en_us: mister...

source: 네 못난 아비를 용서하거라.
en_us: forgive your sinful father.

source: 기를 써야 하는 건 알겠는데 한꺼번에 치우기엔 제 내공으론 무리라구요!
en_us: I know I have to use qi, but i don’t have enough qi to clean all of it up in one go!

source: 그렇다면 어째서 맹에 가입된 모든 맹도가 무당의 3류 무공을 익혀야 하는 거요?!
en_us: then why are all alliance members required to learn wudang’s three martial arts styles?!

source: 어휴, 그딴 초식으로는 귀령수라고 하기에도 민망하네.
en_us: oh my, it’s embarrassing to call those movements the ghost king’s martial arts.

source: 멧돼지가 아니었군···
en_us: so it wasn’t a boar…

source: 우리 아버지야.
en_us: that was my father.

source: 흑사맹이란 겨우 이런 거였나?
en_us: is this all the black death sect is worth?

source: 이 ㅅ끼···
en_us: bastard…

source: 오늘 부로···
en_us: from today on…

source: 하지만 아버지의 생각은 좀 달랐어.
en_us: but my father disagreed.

source: 강태연, 넌 정의라는 거짓을 믿은 죄로 죽는거다.
en_us: taeyeon kang, you’re dying for the sin of believing in the lie of justice.

source: 나선화, 특별히 이상한 점은 없다.
en_us: there’s nothing particularly strange about seonhwa na.

source: 첫째 놈만 그리 안 됐으면 네놈에게 눈길 한 번 줬을 것 같냐?
en_us: do you think I would’ve even spared you a glance had my firstborn not ended up the way he did?

source: 게다가 쉴틈없이 공격이 들어온다!
en_us: not to mention, there’s no time to rest between attacks!

source: 그런 거 생각하기엔 난 너무 약하다.
en_us: I’m too weak to think about something like that.

source: 생각보다 시간이 더 걸려서···.
en_us: it took longer than i expected…

source: 구제하기엔 너무 늦었어.
en_us: it’s too late to save him.

source: 돌돌 말아서ꞏꞏꞏ
en_us: I twirled it around...

source: 하지만 넌 별개야.
en_us: but you’re different.

source: 이상하네, 내가 내상을 힙히진 않았는데···
en_us: that’s strange, I didn’t give him any internal injuries…

source: 모처럼 전에 하다 만 일을 계속 할 수 있나 싶었는데···
en_us: I thought I could finish what i started last time…

source: 아까보다 더 많은 기를 끌어모았는데도 하나도 안 힘들어!
en_us: I’m not tired even though i used more qi than before!

source: 뭐, 아무튼 이쪽이다.
en_us: well, in any case, it’s this way.

source: 읍, 읍?!
en_us: mmph?!

source: 어허, 나는 하루라도 안 뛰면 입에 가시가 돋는단다.
en_us: no way. I’ll die if I stop running even for a day.

source: 야, 저기···
en_us: hey, look over there…

source: 글
en_us: story by

source: 그렇다면ꞏꞏꞏ
en_us: in that case...

source: 쿠우
en_us: flash

source: 글 손고후
en_us: story by gohoo son

source: 가지세요ꞏꞏꞏ
en_us: you can have it...

source: 추가 주문하신 음식 나왔습니다~
en_us: here’s that additional food you ordered!

source: 쩌엉
en_us: boom

source: 게다가 흑마서고의 또 다른 한 권까지 망나니의 손에···
en_us: moreover, the other book has fallen into this dirtbag’s hands…

source: 시험해볼까ꞏꞏꞏ?
en_us: should I test it out...?

source: 스스스슥
en_us: whish whish whish

source: 안 통한다' 수준이 아니라 어불성설인 거지···
en_us: it’s not just that attacks don’t work against it. the very idea is absurd…

source: 파지지직
en_us: crackle

source: 아니, 홍 교수라 불러야 하나?
en_us: or should I call you professor hong?

source: 소가 말을 하네.
en_us: a talking cow.

source: 천한 놈들끼리 아주 합이 잘 맞아.
en_us: you low-lives make a great pair.

source: 겨우 이 정도면 어쩌자는 거야!
en_us: so what am I supposed to do if this is the best he’s got?!

source: 큭큭, 이런 눈물겨운 우정이 다 있나!
en_us: aw, what a beautiful friendship you have!

source: 사대호법 가신
en_us: vassal of the four great guardians

source: 이봐, 여기라고.
en_us: hey, over here.

source: 지금부터 널 쓰러뜨릴 남자다.
en_us: I’m the man who will defeat you.

source: 덕분에 거기 되팔램들 성지 돼서 웃돈 주고 가져와야 함.
en_us: the place has been heaven for scalpers ever since, so it’ll cost you extra.

source: 우리 아빠 알긴 하세요?
en_us: do you really know my dad?

source: 그만둬!
en_us: stop it!

source: 퍼
en_us: sm

source: 오히려 좋다.
en_us: actually, this is a good thing.

source: 독사는 놈을 만나고 나서 반쯤 미쳐버렸고ꞏꞏꞏ
en_us: the viper nearly had a breakdown after meeting him...

source: 한꺼번에라ꞏꞏꞏ
en_us: all at once, huh...?

source: 에구구
en_us: gosh

source: 뭣ꞏꞏꞏ?
en_us: what...?

source: 나는··· 나는 어쩌라구!
en_us: what… what about me?!

source: 몇 시간 전, 흑마관
en_us: a few hours ago, the black demon library

source: 피···?
en_us: blood…?

source: 저희의 필살기 합주공선율을 작은 나이프 하나로 버텨내더군요.
en_us: he held out against our ensemble tune attack with only a small knife.

source: 덕분에 나 혼자 힘들게 심부름을ꞏꞏꞏ
en_us: it’s his fault i’m working my butt off doing these errands by myself...

source: 팍
en_us: shove

source: 그래, 오너라!
en_us: that’s right, come at me!

source: 안그래도 짜증나는데ꞏꞏꞏ
en_us: as if my day couldn’t get any worse...

source: 따{j}악
en_us: flick

source: 키우우우우
en_us: fwoosh

source: 화 진 빌 딩
en_us: hwajin building

source: 라면
en_us: instant noodles

source: 쏘옥
en_us: shwp

source: 훌쩍
en_us: shake

source: 우와아악!
en_us: aaah!

source: 이놈ꞏꞏꞏ!
en_us: you rascal...!

source: 아쉽지만 놀아주는 건 여기까지.
en_us: it’s a shame, but my playtime with you ends now.

source: 찍
en_us: spit

source: 아니까 아갈 해아 좀···
en_us: ugh, don’t remind me…

source: 평범한 쓸기로는 안 쓸리게 한 것 같다.
en_us: i bet it’s set up so using the broom normally won’t work.

source: 받은 메세지
en_us: new message

source: 그래ꞏꞏꞏ
en_us: good...

source: 한국은행
en_us: bank of korea

source: 귀령왕의 무기 '삼기도'ꞏꞏꞏ
en_us: the ghost king’s weapons, the ‘three spirits blades’...

source: 봉이 길이가 자유자재로 변하는 것 같은 착각이 든다ꞏꞏꞏ
en_us: it’s like he can change the length of his staff as he pleases...

source: 왜 많고 많은 놈들 중에 하필 저 성가신 거지 놈이야?
en_us: of all people, why does it have to be this annoying bum?

source: 뭐하니?
en_us: what are you doing?

source: 한 달 전 전륜법궁
en_us: one month ago revolution palace

source: 여기가 흑사맹의 본산이라는 것 알고 왔겠지?
en_us: i’m sure you came here knowing this is the main base of the black death sect?

source: 어쩐지 너무 쉬운 걸 시킨다 했더니!
en_us: I knew it couldn’t be that easy!

source: 넌 목표가 뭐냐?
en_us: what’s your goal?

source: 안돼, 저놈 뭔가 이상하다!
en_us: there’s something off about him!

source: 푸웁
en_us: keugh

source: 근데 뒤도 좀 보고 사셔야죠~
en_us: but you should really be watching your back.

source: 어째서 사파 제일의 흑사맹도들이 단 한 명에게 뚫린단 말이냐!
en_us: how is it possible for one person to get past the disciples of the black death sect, the greatest sect in the evil faction?!

source: 천원
en_us: one thousand won*

source: 그 살귀에게 마샴바라는 나한의 법명을 내려주고
en_us: this evil spirit was given the buddhist name of mashamba...

source: 바, 방금 내가 무슨 생각을···
en_us: wh-what am i thinking…

source: 우리가 도착한 후 바로 사려져버렸지.
en_us: he disappeared immediately after we arrived.

source: 이렇게까지 할 생각은 없었는데···
en_us: I didn’t wanna go this far…

source: 이 정도 함정에 걸려들 줄이야.
en_us: to think you’d fall for such a simple trap.

source: 타락한 마샴바···
en_us: the fallen mashamba…

source: 어디서 가짜 따위가···
en_us: you fake, how dare you…

source: 마침 흑사맹을 어떻게 해야 할까 생각하고 있었는데···
en_us: I was just wondering what I should do with the black death sect…

source: 이 근골은 뭐지?!
en_us: what’s with that physique?!

source: 정신이 드냐?
en_us: are you finally awake?

source: 3인 1조로 재편성하도록 하겠다!
en_us: i’m reorganizing everyone into groups of three!

source: 천한 놈이라···
en_us: a lowborn bastard, huh…

source: 어딨어 나머지 한 권.
en_us: where’s the other volume?

source: 뭐해, 빨리 꺼지지 않고!
en_us: what are you doing?! hurry up and go away!

source: 아직 애송이군.
en_us: he’s still a brat.

source: 이 자식, 설마 동귀어진이 수를···!
en_us: don’t tell me she’s gonna use the suicidal technique…?!

source: 촤 악
en_us: slam

source: 왜 소가주가 여기 있는 거야?
en_us: what is the next sect leader doing here?

source: 영혼만은 살귀가 되어 여전히 사람들을 해쳤으니
en_us: however, his soul became murderous, and he continued to harm people.

source: 빨리 끝내라 13호!
en_us: just end this already, 13!

source: 귀령파를 써야겠어!
en_us: I have to use the ghostly spirit wave!

source: 아저씨!
en_us: mister!

source: 한꺼번에?
en_us: all at once?

source: 아, 알겠습니다.
en_us: a-all right.

source: (깨끗)
en_us: (empty)

source: 촤앗
en_us: slash

source: 윽!
en_us: ugh!

source: 따
en_us: fw

source: 도
en_us: ox knee soup

source: 쓰레기 무공으로 모든 문파에 무당의 지배력을 강화하려는 어두운 속내를 모를 것 같은가?
en_us: do you think i don’t see through your plan to increase wudang’s influence through garbage martial arts?

source: 마, 말도 안 돼.
en_us: n-no way.

source: 살수문
en_us: assassin sect

source: 부앙
en_us: smash

source: 기적아!
en_us: gijeok!

source: 그동안 아들이 참 보고 싶었을 것 같은데?
en_us: I’m sure you’ve been dying to see your son, right?

source: 꾸르륵
en_us: growl

source: 28화
en_us: episode 28

source: 퍼벅
en_us: thwack

source: 흑익사홍문' 출신 1학년 특별 편입생 나선화ꞏꞏꞏ
en_us: seonhwa na, first year special transfer student from the blackest deceit sect...

source: 후비적
en_us: dig

source: 쉬이이
en_us: fshh

source: 조심해.
en_us: watch it.

source: 지금 무슨 짓을 저질렀는지 알고 있나?
en_us: do you understand what you’ve done?

source: 흠, 글쎄ꞏꞏꞏ
en_us: hmm, well...

source: 여기 체육관 아닌가?
en_us: isn’t this supposed to be the gym?

source: 꿀꺽
en_us: shudder

source: 그만!!
en_us: stop!!!

source: 크윽, 이래선 승산이 없다ꞏꞏꞏ
en_us: ugh, I can’t win like this..

source: 뭐ꞏꞏꞏ
en_us: did...

source: 큭큭큭큭
en_us: krrrk

source: 타
en_us: step

source: 강태연 이자식!
en_us: where did

source: 엄마 가면 나 안돼, 엄마 제발 가지마···
en_us: don’t go, mom, please don’t go…

source: 막아라!!
en_us: stop them!!!

source: 저 학생이 저를 지키려다 그만ꞏꞏꞏ
en_us: that boy got like that while trying to protect me...

source: 이것도 피해봐라 이 ㅅ바라마!
en_us: try dodging this, f*cker!

source: 야 미친놈아, 아무리 배고파도 그렇지!
en_us: you fool! you shouldn't eat that no matter how hungry you are!

source: 큭, 저게 누구보고ꞏꞏꞏ
en_us: ugh, just who do you think you are...?

source: 베는 순간의 빈틈에 정확히 찔러넣을 줄이야.
en_us: she actually stabbed me at the exact moment that I slashed her.

source: 네 아버지와 같이···
en_us: you end up becoming…

source: 간혹 살인을 저지르더라도 전부 무림인이 대상이었지.
en_us: even the times he’s killed, the only victims were murimists.

source: 무림인들은 강함을 숭배하는 무리지ꞏꞏꞏ
en_us: the people of murim admire strength...

source: 이정도인가ꞏꞏꞏ
en_us: is that the best you can do...?

source: 바꾸면 되는 거 아닌가요?
en_us: can’t I change just partners?

source: 가, 강태연?
en_us: t-taeyeon?

source: 하지만 나에게 진다면···
en_us: but if you lose…

source: 나한테 귀령파를 쏴라!
en_us: hit me with the ghostly spirit wave!

source: 빠박
en_us: thwack thwack
